[
  {
    "id": "kronverksky",
    "name": "Кронверкский корпус",
    "shortName": "Кронверкский пр., 49",
    "address": "Кронверкский пр., 49",
    "lat": 59.9569,
    "lng": 30.3175,
    "year": 1900,
    "style": "Эклектика, неоклассицизм",
    "joined": 1930,
    "role": "Главный учебный корпус, администрация",
    "cover": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/ITMO_University_logo_ru.svg/1200px-ITMO_University_logo_ru.svg.png",
    "summary": "Главный корпус университета ИТМО",
    "history": "Здание на Кронверкском проспекте, 49 является визитной карточкой университета ИТМО. Построенное в начале XX века, оно изначально предназначалось для нужд ремесленного образования в Санкт-Петербурге. Архитектурный облик здания сочетает черты позднего петербургского классицизма и нарождавшегося модерна — строгость фасадов смягчается изысканной лепниной и ритмом высоких окон.\n\nВ советский период здание претерпело функциональные изменения: его приспособили под нужды Ленинградского института точной механики и оптики, который впоследствии стал ИТМО. Постепенно корпус превратился в административный и учебный центр: здесь размещались деканаты, кафедры и ректорат.\n\nСегодня после масштабной реновации Кронверкский корпус сочетает историческую архитектуру с современной инфраструктурой: коворкинги, аудитории нового поколения и открытые общественные пространства делают его живым центром кампуса.",
    "facts": [
      "Здание возведено в 1900–1906 годах по проекту петербургских архитекторов",
      "Входит в список объектов культурного наследия Санкт-Петербурга",
      "В холле корпуса установлены памятные доски выдающимся выпускникам ИТМО",
      "В 2019 году проведена масштабная реконструкция фасада"
    ],
    "sources": [
      "Архивный фонд ИТМО, документы 1930–1950 гг.",
      "Канцелярия Санкт-Петербургского городского архива",
      "Энциклопедия «Архитектура Санкт-Петербурга», 2011"
    ]
  },
  {
    "id": "lomonosova",
    "name": "Корпус на Ломоносова",
    "shortName": "ул. Ломоносова, 9",
    "address": "ул. Ломоносова, 9",
    "lat": 59.9270,
    "lng": 30.3370,
    "year": 1887,
    "style": "Петербургский классицизм, историзм",
    "joined": 1948,
    "role": "Физические и химические лаборатории",
    "cover": null,
    "summary": "Исторический корпус в центре Петербурга",
    "history": "Улица Ломоносова расположена в самом сердце исторического Петербурга, и здание под номером 9 несёт в себе память о нескольких эпохах городской жизни. Первоначально возведённое во второй половине XIX века как доходный дом, оно отличается характерной для петербургского историзма строгостью фасада: рустованный цоколь, симметричные ризалиты и лаконичный карниз.\n\nПосле революции здание перешло в государственную собственность и долгое время использовалось для нужд различных учебных заведений. В конце 1940-х годов оно вошло в состав ЛИТМО: здесь разместились лаборатории физического факультета, а позднее — кафедры прикладной физики и фотоники.\n\nСейчас корпус прошёл техническую модернизацию, сохранив исторический облик. В отремонтированных аудиториях работают студенческие научные группы, а подвальные этажи переоборудованы под современные мастерские и fab-lab пространство.",
    "facts": [
      "Построено в 1887 году как доходный дом петербургского купечества",
      "В советское время являлось учебным корпусом нескольких вузов одновременно",
      "В здании сохранились исторические парадные лестницы с чугунными перилами",
      "Корпус расположен в пешей доступности от Государственного Эрмитажа"
    ],
    "sources": [
      "Петроградский городской архив, фонды 1900–1920 гг.",
      "История ЛИТМО: хроника факультетов, 1990",
      "Реестр памятников архитектуры Санкт-Петербурга"
    ]
  },
  {
    "id": "birzhevaya",
    "name": "Биржевой корпус",
    "shortName": "Биржевая линия, 14",
    "address": "Биржевая линия, 14",
    "lat": 59.9435,
    "lng": 30.2900,
    "year": 1912,
    "style": "Северный модерн, промышленная эклектика",
    "joined": 1962,
    "role": "Информационные технологии и вычислительная техника",
    "cover": null,
    "summary": "Корпус на Васильевском острове с индустриальным прошлым",
    "history": "Биржевая линия Васильевского острова — одно из старейших улиц города, связанных с торговлей и промышленностью. Здание под номером 14 было возведено в 1912 году как складской и конторский комплекс для нужд петербургских купцов, ведущих дела через биржу.\n\nАрхитектура постройки отражает типичный для промышленного северного модерна синтез: гранитный цоколь, широкие фасадные проёмы для естественного освещения, сдержанный декор с геометрическими мотивами. После революции здание использовалось как склад и жилой корпус, прежде чем попасть в ведение ЛИТМО в начале 1960-х годов.\n\nС 1962 года здесь размещались вычислительные центры — сначала с ламповыми ЭВМ, а затем с транзисторными машинами серий БЭСМ и ЕС ЭВМ. Сегодня бывшие машинные залы преобразованы в современные дата-классы и открытые лаборатории для студентов направления «Информационные системы».",
    "facts": [
      "В 1960-х здесь располагался один из первых вузовских вычислительных центров Ленинграда",
      "Высокие потолки бывших складов позволили разместить стойки с ЭВМ без реконструкции",
      "Васильевский остров — исторический научный центр Петербурга, здесь расположена РАН",
      "В 2015 году корпус получил статус объекта индустриального наследия"
    ],
    "sources": [
      "Музей истории ИТМО, экспозиция «Вычислительная техника ЛИТМО»",
      "Архивы Ленгорисполкома, фонды 1960–1970 гг.",
      "Г. Г. Андреев. «Архитектура Васильевского острова». СПб., 2003"
    ]
  },
  {
    "id": "grivtsova",
    "name": "Корпус на Гривцова",
    "shortName": "пер. Гривцова, 14",
    "address": "пер. Гривцова, 14",
    "lat": 59.9295,
    "lng": 30.3172,
    "year": 1898,
    "style": "Доходный дом, петербургская эклектика",
    "joined": 1955,
    "role": "Гуманитарные дисциплины и иностранные языки",
    "cover": null,
    "summary": "Компактный исторический корпус в центре города",
    "history": "Переулок Гривцова — один из многочисленных тихих петербургских переулков, соединяющих шумные магистрали с дворами-колодцами. Дом 14 построен в конце XIX века как доходный дом средней руки: без парадной роскоши, но с характерной петербургской добротностью — толстые стены из кирпича, дворовые флигели, высокие потолки.\n\nВ советский период помещения сменили множество владельцев, пока в середине 1950-х годов здание не перешло к ЛИТМО. Его компактность оказалась удобной для кафедр, которым не требовались большие лабораторные площади: сначала здесь работала кафедра иностранных языков, позднее добавились кафедра философии и социальных наук.\n\nСегодня корпус специализируется на гуманитарной составляющей технического образования: языковые классы оснащены современным мультимедиа-оборудованием, а небольшой конференц-зал используется для международных встреч и студенческих дебатов.",
    "facts": [
      "Один из немногих корпусов ИТМО, расположенных во внутреннем переулке исторического центра",
      "В здании сохранились оригинальные кирпичные своды подвального этажа",
      "Кафедра иностранных языков работает в этом корпусе с 1957 года",
      "В 2020 году проведена полная замена оконных блоков с сохранением исторических пропорций"
    ],
    "sources": [
      "Протоколы заседаний ректората ЛИТМО, 1955–1960 гг.",
      "Справочник «Улицы и переулки Центрального района СПб», 2008",
      "Личные воспоминания сотрудников кафедры иностранных языков ИТМО"
    ]
  },
  {
    "id": "tchaikovsky",
    "name": "Корпус Чайковского",
    "shortName": "ул. Чайковского, 11",
    "address": "ул. Чайковского, 11",
    "lat": 59.9472,
    "lng": 30.3601,
    "year": 1875,
    "style": "Петербургский классицизм, историзм",
    "joined": 1971,
    "role": "Оптика, фотоника и нанотехнологии",
    "cover": null,
    "summary": "Корпус в Литейной части, флагман фотонных исследований",
    "history": "Улица Чайковского пролегает через один из наиболее аристократических районов Петербурга — Литейную часть. Здание номер 11 было возведено в 1875 году и первоначально принадлежало состоятельному петербургскому семейству как городская усадьба. Архитектура постройки отличается академической строгостью: рустованный фасад, высокие арочные окна бельэтажа, кованые ограды.\n\nВ начале XX века дом был приспособлен под нужды учебных заведений. После 1917 года он использовался различными организациями, а в 1971 году был передан ЛИТМО. Выбор оказался символичным: именно здесь развернулись ключевые исследования по лазерной физике и голографии, благодаря которым ИТМО завоевал международное признание.\n\nСегодня корпус является одним из ведущих исследовательских центров в области фотоники и нанотехнологий. Здесь работают лаборатории мирового уровня, сотрудничающие с European Photonics Industry Consortium, а студенты получают доступ к уникальному научному оборудованию.",
    "facts": [
      "В 1980-х здесь была создана одна из первых в СССР голографических лабораторий",
      "Корпус стал базой для научных публикаций ИТМО в рейтинге Nature Index",
      "Высокие потолки бельэтажа позволяют размещать крупные оптические стенды",
      "В 2018 году установлен чистый класс ISO 6 для нанотехнологических исследований"
    ],
    "sources": [
      "Архив лаборатории фотоники ИТМО, публикации 1980–2000 гг.",
      "Реестр объектов культурного наследия Санкт-Петербурга, номер 7810521",
      "И. В. Мегорский. «Литейная часть: архитектурный облик». СПб., 2006"
    ]
  }
]
